Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལུས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Uncluttered Mind will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དུང་ཕྱུར་ཕྲག་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be seven hundred million consecutive congregations of hearers, each of them gathering one hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་ལག་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་ལྷའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: “The thus-gone Subāhu will be born in a place called Divine Stūpa.

source: ཡབ་ནི་བཤེས་གཉེན་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Friend will be his father.

source: ཡུམ་ནི་བརྟན་འགྲོ་མ་ཞེས་བྱའོ། །
en: Stable Movement will be his mother.

source: སྲས་ནི་མཆོག་འདོད་ཅེས་བྱའོ། །
en: Supreme Wish will be his son.

source: རིམ་གྲོ་པ་ནི་བདུད་རྩི་སྒྲོགས་ཞེས་བྱའོ། །
en: Nectar Proclaimer will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲ་གཅན་ཤིས་པ་ཞེས་བྱའོ། །
en: Auspicious Rāhu will be foremost in terms of insight.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ། །ཐམས་ཅད་ལ་ཡང་བྱེ་བ་སུམ་ཅུ་རྩ་བརྒྱད་བརྒྱད་དོ། །
en: There will be twenty-two consecutive congregations of hearers, each of them gathering three hundred eighty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཆེན་པོ་སྐྱེ་བའི་ཡུལ་ནི་ནོར་དགའ་ཞེས་བྱའོ། །
en: “The thus-gone Mahāraśmi will be born in a place called Jewel Joy.

source: ཡབ་ནི་བདུད་རྩི་དགའ་ཞེས་བྱའོ། །
en: Nectar Joy will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་འདོད་ཅེས་བྱའོ། །
en: Wish for Qualities will be his mother.

source: སྲས་ནི་རོ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Taste will be his son.

source: རིམ་གྲོ་པ་ནི་རོ་བརྒྱ་པ་ཞེས་བྱའོ། །
en: Hundred Tastes will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་སེམས་ཞེས་བྱའོ། །
en: Mind of Power will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྙོག་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Unsullied Mind will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་གཅིག་བཅུ་གཅིག་གོ། །
en: There will be eleven consecutive congregations of hearers, each of them gathering one hundred ten million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-one thousand years.

source: དེ་བཞིན་གཤེགས་པ་བསམ་པས་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་བསམ་པ་ཡང་དག་འཕགས་ཞེས་བྱའོ། །
en: “The thus-gone Āśādatta will be born in a place called Truly Superior Thought.

source: འོད་ནི་དཔག་ཚད་དགུ་སྟོང་ངོ་། །
en: His light will extend nine thousand leagues.

source: ཡབ་ནི་གསང་བ་མཐོང་ཞེས་བྱའོ། །
en: Seeing the Secret will be his father.

source: ཡུམ་ནི་བརྟུལ་ཞུགས་ཡང་དག་འཕགས་ཞེས་བྱའོ། །
en: Truly Superior Yogic Discipline will be his mother.

source: སྲས་ནི་སྐྱོན་མེད་ང་རོ་ཞེས་བྱའོ། །
en: Flawless Roar will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་དབྱངས་ཞེས་བྱའོ། །
en: Precious Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་བའི་སྤོས་ཞེས་བྱའོ། །
en: Virtuous Incense will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གདངས་པོ་ཆེ་ཞེས་བྱའོ། །
en: Great Tone will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་བདུན་བཅུ་བདུན་ནོ། །
en: There will be twelve consecutive congregations of hearers, each of them gathering one hundred seventy million.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་འོད་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ཕུང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Puṇyābha will be born in a place called Heap of Merit.

source: ཡབ་ནི་བསོད་ནམས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Merit Splendor will be his father.

source: ཡུམ་ནི་བསོད་ནམས་འོད་ཟེར་ཞེས་བྱའོ། །
en: Merit Radiance will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་གྲགས་པ་ཞེས་བྱའོ། །
en: Splendid Fame will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷའི་གྲགས་པ་ཞེས་བྱའོ། །
en: Divine Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཉི་མའི་འོད་ཅེས་བྱའོ། །
en: Sunlight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Intelligence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be six consecutive congregations of hearers, each of them gathering three million.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་དབྱངས་སྐྱེ་བའི་ཡུལ་ནི་ཐར་པའི་དབྱངས་ཞེས་བྱའོ། །
en: “The thus-gone Ratnaruta will be born in a place called Melody of Liberation.

source: ཡབ་ནི་བཻ་དཱུརྱའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Beryl Essence will be his father.

source: ཡུམ་ནི་ཐར་པའི་ང་རོ་ཞེས་བྱའོ། །
en: Roar of Liberation will be his mother.

source: སྲས་ནི་མི་གནས་ཐོབ་ཅེས་བྱའོ། །
en: Attainment of Nonabiding will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷས་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by Gods will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀླུས་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by Nāgas will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་བཞི་སྟོང་བཞི་སྟོང་ངོ་། །
en: There will be fifty consecutive congregations of hearers, each of them gathering fourteen thousand.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེའི་སྡེ་སྐྱེ་བའི་ཡུལ་ནི་མི་ཕྱེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vajrasena will be born in a place called Indivisible.

source: ཡབ་ནི་མི་ཕྱེད་པར་དགའ་བ་ཞེས་བྱའོ། །
en: Indivisible Joy will be his father.

source: ཡུམ་ནི་རྡོ་རྗེའི་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Vajra Intelligence will be his mother.

source: སྲས་ནི་དགའ་བའི་སེམས་ཞེས་བྱའོ། །
en: Mind of Joy will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀླུའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Nāga Flower will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by the World will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་རེ་རེའོ། །
en: There will be fourteen consecutive congregations of hearers, each of them gathering two hundred million.

source: དེ་བཞིན་གཤེགས་པ་འབྱོར་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་ཐམས་ཅད་འབྱོར་པ་ཞེས་བྱའོ། །
en: “The thus-gone Samṛddha will be born in a place called Universal Wealth.

source: འོད་ནི་དཔག་ཚད་ལྔ་སྟོང་ངོ་། །
en: His light will extend five thousand leagues.

source: ཡབ་ནི་འབྱོར་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Wealth will be his father.

source: ཡུམ་ནི་དགེ་རྒྱལ་མ་ཞེས་བྱའོ། །
en: Queen of Virtue will be his mother.

source: སྲས་ནི་རྒྱལ་ཆེན་ཞེས་བྱའོ། །
en: Great King will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Gods will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་འོས་ཞེས་བྱའོ། །
en: Light of Worship will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མ་སྤངས་པ་ཞེས་བྱའོ། །
en: Nothing Lacking will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be seven consecutive congregations of hearers, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟོབས་སྐྱེ་བའི་ཡུལ་ནི་སྟོབས་ཆེན་ཞེས་བྱའོ། །
en: “The thus-gone Siṃhabala will be born in a place called Great Strength.

source: ཡབ་ནི་ཀླུ་སྟོབས་ཞེས་བྱའོ། །
en: Nāga Strength will be his father.

source: སྲས་ནི་རིན་ཆེན་སྟོབས་ཞེས་བྱའོ། །
en: Jewel Strength will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་སྟོབས་ཞེས་བྱའོ། །
en: Strength of Excellent Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་སྟོབས་ཞེས་བྱའོ། །
en: Strength of Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིགས་མེད་སྟོབས་ཞེས་བྱའོ། །
en: Fearless Strength will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་ལྔ་ལྔའོ། །
en: There will be fifty consecutive congregations of hearers, each of them gathering five hundred million.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པའི་སྤྱན་སྐྱེ་བའི་ཡུལ་ནི་མིག་ཏུ་སྡུག་ཅེས་བྱའོ། །
en: “The thus-gone, stainless Netra, will be born in a place called Delightful to the Eye.

source: ཡབ་ནི་མིག་མཚུངས་ཞེས་བྱའོ། །
en: Even Eyes will be his father.

source: ཡུམ་ནི་ཡིད་འོང་མིག་ཅེས་བྱའོ། །
en: Beautiful Eyes will be his mother.

source: སྲས་ནི་བདུད་རྩིའི་ལྷ་ཞེས་བྱའོ། །
en: God of Nectar will be his son.

source: རིམ་གྲོ་པ་ནི་དམིགས་པ་གསལ་ཞེས་བྱའོ། །
en: Clear Focal Point will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱལ་བའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa of the Victorious Ones will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་ཟད་པའི་བློ་ཞེས་བྱའོ། །
en: Inexhaustible Intellect will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་བདུན་སྟོང་བདུན་སྟོང་ངོ་། །
en: There will be sixteen consecutive congregations of hearers, each of them gathering seventeen thousand.

source: དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་བཟང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Kāśyapa will be born in a place called Excellent Land.

source: ཡབ་ནི་ལྷའི་དྲང་སྲོང་ཞེས་བྱའོ། །
en: Divine Sage will be his father.

source: སྲས་ནི་རིག་པའི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Power of Knowledge will be his son.

source: རིམ་གྲོ་པ་ནི་ཀུན་ཏུ་བློ་ཞེས་བྱའོ། །
en: Universal Intellect will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་མེད་བློ་ཞེས་བྱའོ། །
en: Unobscured Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་བརྩེགས་ཞེས་བྱའོ། །
en: Merit Summit will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་བཞི་བཞིའོ། །
en: There will be ninety consecutive congregations of hearers, each of them gathering nine hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་བློ་གསལ་སྐྱེ་བའི་ཡུལ་ནི་གསལ་བ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Prasannabuddhi will be born in a place called Luminous.

source: ཡབ་ནི་གསལ་ཅན་ཞེས་བྱའོ། །
en: Clear will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་གསལ་ཞེས་བྱའོ། །
en: Luminous Qualities will be his mother.

source: སྲས་ནི་ཐར་པ་དད་ཅེས་བྱའོ། །
en: Faith in Liberation will be his son.

source: རིམ་གྲོ་པ་ནི་རྒྱལ་བ་གསལ་ཞེས་བྱའོ། །
en: Luminous Victor will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྨྲ་བ་གསལ་ཞེས་བྱའོ། །
en: Clear Speech will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྫུ་འཕྲུལ་གསལ་ཞེས་བྱའོ། །
en: Miraculous Display of Clarity will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be thirty-two consecutive congregations of hearers, each of them gathering eight billion.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འགྲོས་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཀྱིས་བརྒྱན་ཞེས་བྱའོ། །
en: “The thus-gone Jñānakrama will be born in a place called Splendidly Adorned.

source: ཡབ་ནི་མཐུ་རྩལ་བརྟན་ཞེས་བྱའོ། །
en: Stable Power will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་ཐོབ་ཅེས་བྱའོ། །
en: Wisdom Attained will be his mother.

source: རིམ་གྲོ་པ་ནི་དགའ་སྡུག་ཅེས་བྱའོ། །
en: Beautiful Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བྷ་ར་ཏ་ཞེས་བྱའོ། །
en: Bharata will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་རབ་གསལ་ཞེས་བྱའོ། །
en: Radiant Splendor will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཅུའོ། །
en: There will be thirteen consecutive congregations of hearers, each of them gathering one hundred billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉི་ཁྲི་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be twenty-seven thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for thirteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དྲག་ཤུལ་ཅན་སྐྱེ་བའི་ཡུལ་ནི་ཀུན་ཏུ་གཟི་བརྗིད་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Ugratejas will be born in a place called Universal Splendor.

source: ཡབ་ནི་དྲག་ཤུལ་བརྩེགས་ཞེས་བྱའོ། །
en: Fierce Mountain will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་མེ་ཏོག་ཅེས་བྱའོ། །
en: Splendid Flower will be his mother.

source: སྲས་ནི་དམིགས་པ་མ་འཁྲུལ་ཞེས་བྱའོ། །
en: Unmistaken Observation will be his son.

source: རིམ་གྲོ་པ་ནི་སེམས་བརྟགས་ཞེས་བྱའོ། །
en: Discernment will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟུངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Royal Master of Retention will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུགས་པ་མེད་པར་གནས་ཞེས་བྱའོ། །
en: Remaining Unperturbed will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དྲུག་ཁྲིའོ། །
en: In the first congregation there will be sixty thousand hearers;

source: གཉིས་པ་ལ་ནི་འབུམ་མོ། །
en: in the second there will be one hundred thousand;

source: གསུམ་པ་ལ་ནི་སུམ་འབུམ་མོ། །
en: in the third, three hundred thousand;

source: བཞི་པ་ལ་ནི་དྲུག་འབུམ་མོ། །
en: in the fourth, six hundred thousand;

source: ལྔ་པ་ལ་ནི་བརྒྱད་འབུམ་མོ། །
en: and in the fifth, eight hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཆེན་པོ་སྐྱེ་བའི་ཡུལ་ནི་འོད་ཟེར་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mahāraśmi will be born in a place called Limitless Light.

source: ཡབ་ནི་རིན་ཆེན་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Jewel Lamp will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་མཆོད་ཅེས་བྱའོ། །
en: Splendid Worship will be his mother.

source: སྲས་ནི་ལྷའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Divine Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ལག་མཆོག་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Best Hands will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁམས་གསུམ་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Three Realms will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཕགས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Noble will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be forty consecutive congregations, each of them gathering one hundred sixty million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་སྒྲོན་བྱེད་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Sūryaprabha will be born in a place called Illuminating Light.

source: ཡབ་ནི་གྲགས་པའི་འོད་ཅེས་བྱའོ། །
en: Famed Light will be his father.

source: ཡུམ་ནི་དཔག་མེད་མིག་ཅེས་བྱའོ། །
en: Immeasurable Eye will be his mother.

source: སྲས་ནི་སྐར་མདའ་འོད་ཅེས་བྱའོ། །
en: Luminous Meteor will be his son.

source: རིམ་གྲོ་པ་ནི་འོད་མཐོང་ཞེས་བྱའོ། །
en: Sight of Light will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་འོད་ཅེས་བྱའོ། །
en: Divine Eye will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་འོད་ཅེས་བྱའོ། །
en: Moonlight will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be ninety consecutive congregations, each of them gathering eight billion.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་མི་འཁྲུགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vimalaprabha will be born in a place called Unshakable Array.

source: ཡབ་ནི་ལྷའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Divine Splendor will be his father.

source: ཡུམ་ནི་ལུས་དགའ་མ་ཞེས་བྱའོ། །
en: Body of Delight will be his mother.

source: སྲས་ནི་ཡན་ལག་མ་སྨད་པ་ཞེས་བྱའོ། །
en: Impeccable Limbs will be his son.

source: རིམ་གྲོ་པ་ནི་སྐྱོན་མེད་ལུས་ཞེས་བྱའོ། །
en: Flawless Body will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕ་རོལ་ཕྱིན་ཐོབ་ཅེས་བྱའོ། །
en: Transcendence Attained will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔག་མེད་འགྲོ་ཞེས་བྱའོ། །
en: Immeasurable Movement will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་དགུའོ། །
en: There will be forty consecutive congregations, each of them gathering ninety million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་སུམ་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for thirty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་རྣམ་པར་འབྱེས་པ་སྐྱེ་བའི་ཡུལ་ནི་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vibhaktatejas will be born in a place called Tremendous Detail.

source: ཡབ་ནི་གཟི་བརྗིད་དཔལ་ཞེས་བྱའོ། །
en: Glorious Splendor will be his father.

source: རིམ་གྲོ་པ་ནི་ཁ་ལོ་སྒྱུར་བའི་སྤོས་ཞེས་བྱའོ། །
en: Leader Fragrance will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་དགེ་ཞེས་བྱའོ། །
en: Virtuous Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་ལག་ཅེས་བྱའོ། །
en: Hand of Merit will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་རྩ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་སུམ་ཁྲི་སུམ་ཁྲིའོ། །
en: There will be forty-eight consecutive congregations, each of them gathering thirty thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་བཅུ་བཞིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for one hundred and forty million years.

source: དེ་བཞིན་གཤེགས་པ་ཁེངས་མེད་སྐྱེ་བའི་ཡུལ་ནི་རྫོགས་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Anuddhata will be born in a place called Perfection.

source: ཡབ་ནི་མི་ཚུགས་པ་ཞེས་བྱའོ། །
en: Indomitable will be his father.

source: ཡུམ་ནི་ཁྱད་པར་ཐོབ་ཅེས་བྱའོ། །
en: Distinctive Attainment will be his mother.

source: སྲས་ནི་འཇིག་རྟེན་ཁྱད་པར་འཕགས་ཞེས་བྱའོ། །
en: Distinguished World will be his son.

source: རིམ་གྲོ་པ་ནི་འདྲ་མེད་ཅེས་བྱའོ། །
en: Unequaled will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་ཁྱད་པར་འཕགས་ཞེས་བྱའོ། །
en: Distinguished World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁྱད་པར་འཕགས་ཞེས་བྱའོ། །
en: Distinguished will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be thirty consecutive congregations, each of them gathering ten thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྦྲང་རྩིའི་ཞལ་སྐྱེ་བའི་ཡུལ་ནི་གཅིག་ཏུ་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Madhuvaktra will be born in a place called Singularly Delightful.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་སྟོང་ངོ་། །
en: His light will extend eight thousand leagues.

source: ཡབ་ནི་དགའ་བྱེད་ཅེས་བྱའོ། །
en: Instiller of Joy will be his father.

source: ཡུམ་ནི་བདུད་རྩི་བྱེད་ཅེས་བྱའོ། །
en: Nectar Giver will be his mother.

source: སྲས་ནི་བཀོད་པ་མི་འཁྲུལ་ཞེས་བྱའོ། །
en: Unmistaken Array will be his son.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤུགས་འཆང་ཞེས་བྱའོ། །
en: Holder of Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be fifty-nine consecutive congregations, each of them gathering six hundred million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་ཁྲི་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་འོད་སྐྱེ་བའི་ཡུལ་ནི་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Candraprabha will be born in a place called Stainless Light.

source: ཡུམ་ནི་ཟླ་བའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Moon Flower will be his mother.

source: སྲས་ནི་ཟླ་སྣང་ཞེས་བྱའོ། །
en: Moonlight will be his son.

source: རིམ་གྲོ་པ་ནི་ཟླ་བཟངས་ཞེས་བྱའོ། །
en: Excellent Moon will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩི་ཟླ་བ་ཞེས་བྱའོ། །
en: Nectar Moon will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷའི་བདུད་རྩི་ཞེས་བྱའོ། །
en: Divine Nectar will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be six consecutive congregations, each of them gathering five billion.

source: དེ་བཞིན་གཤེགས་པ་གློག་འབྱིན་སྐྱེ་བའི་ཡུལ་ནི་ཉི་མའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: “The thus-gone Vidyuddatta will be born in a place called Sun Intelligence.

source: ཡབ་ནི་དབང་པོའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Rulers will be his father.

source: ཡུམ་ནི་ལྷ་མཆོད་མ་ཞེས་བྱའོ། །
en: Divine Worship will be his mother.

source: སྲས་ནི་ཉི་མའི་ཏོག་ཅེས་བྱའོ། །
en: Sun Crest will be his son.

source: རིམ་གྲོ་པ་ནི་སྒྲོན་མ་དྲང་པོ་ཞེས་བྱའོ། །
en: Lamp of Honesty will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གསེར་འོད་དཔལ་ཞེས་བྱའོ། །
en: Glorious Golden Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་ཡོད་གོ་འཕང་གནོན་ཞེས་བྱའོ། །
en: Meaningful Stage will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་རྩ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be forty-five consecutive congregations, each of them gathering seven hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞི་བར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་བློ་བརྟན་ཞེས་བྱའོ། །
en: “The thus-gone Praśāntagāmin will be born in a place called Stable Mind.

source: ཡབ་ནི་འགྲོས་སྙོམས་ཞེས་བྱའོ། །
en: Even Mode will be his father.

source: ཡུམ་ནི་བདེ་འགྲོ་མ་ཞེས་བྱའོ། །
en: Heavenly will be his mother.

source: སྲས་ནི་འཕགས་པ་འདོད་ཅེས་བྱའོ། །
en: Superior Wish will be his son.

source: རིམ་གྲོ་པ་ནི་དགྲ་བཅོམ་འདོད་ཅེས་བྱའོ། །
en: Worthy Wish will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་ཡོད་གོ་འཕང་གནོན་ཞེས་བྱའོ། །
en: Reaching the Meaningful Stage will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་གཅིག་བཅུ་གཅིག་གོ། །
en: There will be twenty-one consecutive congregations, each of them gathering one million one hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་ཉིས་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-two thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བདུན་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for seventy-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་སྐྱེ་བའི་ཡུལ་ནི་འོད་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Akṣobhya will be born in a place called Radiant.

source: ཡབ་ནི་བྱམས་གནས་ཞེས་བྱའོ། །
en: Abiding by Love will be his father.

source: ཡུམ་ནི་སྙིང་རྗེས་གནས་ཞེས་བྱའོ། །
en: Abiding by Compassion will be his mother.

source: སྲས་ནི་ཡིད་མ་འཁྲུགས་ཞེས་བྱའོ། །
en: Unperturbed Mind will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུལ་མེད་ཅེས་བྱའོ། །
en: Free from Delusion will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཡང་དག་འཕགས་ཞེས་བྱའོ། །
en: Truly Superior Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་བཞི་བཞིའོ། །
en: There will be sixteen consecutive congregations, each of them gathering three hundred forty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be eighty-six thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for fourteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་དེ་བཞིན་གཤེགས་པའི་སྤྱན་ཞེས་བྱའོ། །
en: “The thus-gone Arhatkīrti will be born in a place called Eye of the Thus-Gone.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བཅུ་དྲུག་ཙམ་མོ། །
en: His light will extend as far as sixteen worlds of four continents.

source: ཡབ་ནི་དགྲ་བཅོམ་པ་ཞེས་བྱའོ། །
en: Worthy One will be his father.

source: ཡུམ་ནི་འཕགས་བེའུ་མ་ཞེས་བྱའོ། །
en: Noble Mother Cow will be his mother.

source: སྲས་ནི་མྱ་ངན་འདས་པ་གྲགས་ཞེས་བྱའོ། །
en: Famed Freedom from Suffering will be his son.

source: རིམ་གྲོ་པ་ནི་དགྲ་བཅོམ་གསལ་ཞེས་བྱའོ། །
en: Clear Worthy One will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྙན་པ་གྲངས་མེད་པ་ཞེས་བྱའོ། །
en: Infinite Renown will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤོབས་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Acumen will be foremost in terms of miraculous abilities.
